/*
	프로그램
		평문/조건문/반복문
		모든 프로그램 언어 : 변수,연산자,제어문
						------------ 프로그램의 핵심
		배열 : 변수를 여러개 묶어서 관리
		메소드 : 연산자+제어문
		클래스 : 변수+연산자+제어문
		라이브러리 : 제작이 완료된 상태
		
	제어문
	조건문 : 조건에 맞는 내용을 출력
		오류 방지
		
		단일조건문 : true일떄만 처리
			if(조건문){
				조건문이 true일 시 수행
			}
			
			중첩if
			if(조건문){
				if(조건문){
				
				}
			} => if(조건문 && 조건문)
		선택조건문 : true/false 나눠서 처리
		다중조건문
			true일떄 처리 => false일떄 다른 조건 선택
			한개의 문장만 수행
	선택문
	반복문
	반복제어문
 */
public class 단일조건문_정리 {
	public static void main(String[] args) {
		
	}
}
