/*
 *	비트연산자
 *	int a=10;
 *	a&=2; => a=10&2
 *		1010
 *		0010
 *		ㅡㅡㅡ
 *		0010 => 2
 *	a|=2; => a=10|2
 *		1010
 *		0010
 *		ㅡㅡㅡ
 *		1010 => 10
 *	a^=2; => a=10^2
 *		1010
 *		0010
 *		ㅡㅡㅡ
 *		1000 => 8
 *
 *	ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
 *			&	|	^
 *	ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
 *	0	0	0	0	0
 *	ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
 *	0	1	0	1	1
 *	ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
 *	1	0	0	1	1
 *	ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
 *	1	1	1	1	0
 *	ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
 */
public class 복합대입연산자_3 {
	public static void main(String[] args) {
		int a=10;
		a&=2;
		System.out.println(a);
		a=10;
		a|=2;
		System.out.println(a);
		a=10;
		a^=2;
		System.out.println(a);
	}
}
